#+TITLE:     Conferencias y Capacitaciones
#+AUTHOR:    Osiris Alejandro Gómez
#+EMAIL:     osiux@osiux.com
#+LANGUAGE:  es
#+LINK_HOME: index.html
#+INCLUDE:   header.org
#+DATE:      {{{modification-time(%Y-%m-%d %H:%M)}}}

Hace varios años que doy charlas, trato de hacerlo cada vez mejor, asi
que acepto críticas y a medida que detecto posible mejoras las voy
anotando en el post:

[[file:tengo-el-titulo-de-la-charla-y-ahora-como-hago-los-slides.org][Tengo el título de la charla y ahora cómo hago los slides]]

Como siempre armé mis charlas en texto plano y con alguna herramienta
la convierto en un bonito PDF o HTML, el source esta disponible en un
repositorio en [[https://gitlab.com/osiux/charlas]] y el resultado en
[[https://pub.osiux.com/charlas]], asi que a continuación detalle un
resumen y un historial cronológico de todas ellas.

** Resumen

   #+BEGIN_SRC sh :session :results output :exports results
     printf "\n** charlas por tag\n\n"
     egrep -o ":[a-z]+:$" ~/blog/charlas.org | tr -d : | sort | uniq -c | sort -nr | barra
     printf "\n** charlas por año\n\n"
     egrep "^\*+ [0-9]{2}/[0-9]{4}" ~/blog/charlas.org | cut -d/ -f2 | sort | uniq -c | sort -nr | barra
     printf "\n\n** meses más frecuentes\n\n"
     egrep "^\*+ [0-9]{2}/[0-9]{4}" ~/blog/charlas.org | cut -d/ -f1 | tr -d '*' | sort | uniq -c | egrep -v "^.*1 " | sort -nr | barra
     printf "\n\n** eventos más frecuentes\n\n"
     egrep "^\*\*\*\* " ~/blog/charlas.org  | sort | tr -d '*' | uniq -c | grep -v ' 1 ' | sort -nr | sed s/-.*//g | barra
     printf "\n\n** ciudades más frecuentes\n\n"
     egrep "^\*\*\* " ~/blog/charlas.org  | cut -d, -f2 | sort | uniq -c | sort -nr | barra
   #+END_SRC

   #+RESULTS:
   #+begin_example

   ,** charlas por tag

    31.58 %  31.58 %         12 ████████             redes 
    52.63 %  21.05 %          8 █████                coop 
    65.79 %  13.16 %          5 ███                  sysadmin 
    76.32 %  10.53 %          4 ██                   graphviz 
    84.21 %   7.89 %          3 ██                   privacidad 
    92.11 %   7.89 %          3 ██                   orgmode 
    94.74 %   2.63 %          1 ▌                    openvz 
    97.37 %   2.63 %          1 ▌                    gnu 
   100.00 %   2.63 %          1 ▌                    ansible 
			     38
   ,** charlas por año

    21.43 %  21.43 %          6 █████                2011 
    39.29 %  17.86 %          5 ████                 2012 
    50.00 %  10.71 %          3 ██                   2014 
    60.71 %  10.71 %          3 ██                   2013 
    67.86 %   7.14 %          2 █                    2018 
    75.00 %   7.14 %          2 █                    2015 
    82.14 %   7.14 %          2 █                    2008 
    89.29 %   7.14 %          2 █                    2007 
    92.86 %   3.57 %          1 █                    2019 
    96.43 %   3.57 %          1 █                    2016 
   100.00 %   3.57 %          1 █                    2010 
			     28

   ,** meses más frecuentes

    30.77 %  30.77 %          8 ███████              04 
    50.00 %  19.23 %          5 ████                 11 
    61.54 %  11.54 %          3 ███                  10 
    69.23 %   7.69 %          2 ██                   12 
    76.92 %   7.69 %          2 ██                   09 
    84.62 %   7.69 %          2 ██                   07 
    92.31 %   7.69 %          2 ██                   05 
   100.00 %   7.69 %          2 ██                   03 
			     26

   ,** eventos más frecuentes

    71.43 %  71.43 %         10 █████████████████    FLISoL  
    85.71 %  14.29 %          2 ███                  SASOConf  
   100.00 %  14.29 %          2 ███                  CISL  
			     14

   ,** ciudades más frecuentes

    42.86 %  42.86 %         15 ██████████           CABA 
    54.29 %  11.43 %          4 ██                   Curuzú Cuatiá 
    62.86 %   8.57 %          3 ██                   Argentina 
    68.57 %   5.71 %          2 █                    Río Gallegos 
    74.29 %   5.71 %          2 █                    Monte Caseros 
    80.00 %   5.71 %          2 █                    Bogotá 
    82.86 %   2.86 %          1 ▌                    Villa Madero 
    85.71 %   2.86 %          1 ▌                    Porto Alegre 
    88.57 %   2.86 %          1 ▌                    Lanús 
    91.43 %   2.86 %          1 ▌                    La Plata 
    94.29 %   2.86 %          1 ▌                    José C. Paz 
    97.14 %   2.86 %          1 ▌                    Berazategui 
   100.00 %   2.86 %          1 ▌                    Avellaneda 
			     35
   #+end_example

